OSBTestes/Correios/Correios.consultaCEP.wsdl

<?xml version= '1.0' encoding= 'UTF-8' ?>
<wsdl:definitions
     name="Correios.consultaCEP"
     targetNamespace="http://www.nauana.com/Correios/consultaCEP"
     xmlns:tns="http://www.nauana.com/Correios/consultaCEP"
     xmlns:inp1="http://www.nauana.com"
     xmlns:inp2="http://cliente.bean.master.sigep.bsb.correios.com.br/"
     xmlns:xsd="http://www.w3.org/2001/XMLSchema"
     xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
     xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    >
    <wsdl:import namespace="http://cliente.bean.master.sigep.bsb.correios.com.br/" location="Correios.wsdl"/>
    <wsdl:types>
        <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <xsd:import namespace="http://www.nauana.com" schemaLocation="Correios.consultaCEP.xsd"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="requestMessage">
        <wsdl:part name="requestMessage" element="inp1:consultaCEPRequest"/>
    </wsdl:message>
    <wsdl:message name="replyMessage">
        <wsdl:part name="responseMessage" element="inp2:consultaCEP"/>
    </wsdl:message>
    <wsdl:portType name="consultaCEPPortType">
        <wsdl:operation name="consultaCEP">
            <wsdl:input message="tns:requestMessage"/>
            <wsdl:output message="tns:replyMessage"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="consultaCEPBinding" type="tns:consultaCEPPortType">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="consultaCEP">
            <soap:operation style="document" soapAction="consultaCEP"/>
            <wsdl:input>
                <soap:body use="literal" namespace="http://www.nauana.com/Correios/consultaCEP"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal" namespace="http://www.nauana.com/Correios/consultaCEP"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
</wsdl:definitions>
