Monitoramento/Bash e Powershell/webservice-correios/request.xml

<?xml version="1.0" encoding="utf-16"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <consultaCEP xmlns="http://cliente.bean.master.sigep.bsb.correios.com.br/">
      <cep xmlns="">30865060</cep>
    </consultaCEP>
  </soap:Body>
</soap:Envelope>