Tests/Requests/consultaCEP.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://cliente.bean.master.sigep.bsb.correios.com.br/">
   <soapenv:Header/>
   <soapenv:Body>
      <cli:consultaCEP>
         <cep>88132010</cep>
         <usuario>sigep</usuario>
         <senha>n5f9t8</senha>
      </cli:consultaCEP>
   </soapenv:Body>
</soapenv:Envelope>